calm water resistance/KVLCC2/Fr0.1194/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.105948953276574 0 -7.189118742076353)
	(16.658923429914857 0 -7.189118742076353)
	(16.658923429914857 8.180721327190332 -7.189118742076353)
	(-11.105948953276574 8.180721327190332 -7.189118742076353)
	(-11.105948953276574 0 2.974807755341939)
	(16.658923429914857 0 2.974807755341939)
	(16.658923429914857 8.180721327190332 2.974807755341939)
	(-11.105948953276574 8.180721327190332 2.974807755341939)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (112 33 41) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

